; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	spectrograph2 - mode
	image1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Planet11)
	(have_image Phenomenon5 image0)
	(have_image Planet6 spectrograph2)
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Star9 image0)
	(have_image Phenomenon10 image1)
	(have_image Planet11 image0)
	(have_image Planet12 spectrograph2)
	(have_image Star13 image1)
	(have_image Planet14 spectrograph2)
))

)

; plan
1. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 planet7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet7)
   goals met: 0 of 11
5. (take_image satellite0 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 1 of 11
6. (turn_to satellite0 planet6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet6)
   goals met: 1 of 11
7. (take_image satellite0 planet6 instrument1 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 2 of 11
8. (turn_to satellite0 planet14 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet14)
   goals met: 2 of 11
9. (take_image satellite0 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 3 of 11
10. (turn_to satellite0 planet12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet12)
   goals met: 3 of 11
11. (take_image satellite0 planet12 instrument1 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon5 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon5 instrument1 image0)
   added: (have_image phenomenon5 image0)
   goals met: 5 of 11
14. (turn_to satellite0 phenomenon10 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 11
15. (take_image satellite0 phenomenon10 instrument1 image1)
   added: (have_image phenomenon10 image1)
   goals met: 6 of 11
16. (turn_to satellite0 star13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star13)
   goals met: 6 of 11
17. (take_image satellite0 star13 instrument1 image1)
   added: (have_image star13 image1)
   goals met: 7 of 11
18. (turn_to satellite0 star8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star8)
   goals met: 7 of 11
19. (take_image satellite0 star8 instrument1 image1)
   added: (have_image star8 image1)
   goals met: 8 of 11
20. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 8 of 11
21. (take_image satellite0 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 9 of 11
22. (turn_to satellite0 planet11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet11)
   goals met: 10 of 11
23. (take_image satellite0 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 11 of 11
